package com.qingyii.hxtz.wmcj.mvp.model.bean;

import java.util.List;

public class ReportMenu {

    /**
     * error_msg : success
     * error_code : 0
     * data : {"menu_item":[{"id":0,"system_id":0,"title":"最新动态"},{"id":1,"system_id":1,"title":"营造浓厚氛围夯实工作基础"},{"id":2,"system_id":1,"title":"加强理论武装突出廉政建设"},{"id":7,"system_id":1,"title":"打造精神家园培育文明新风"},{"id":8,"system_id":1,"title":"优化内部管理推进综合治理"},{"id":9,"system_id":1,"title":"美化内外环境构筑生态文明"},{"id":10,"system_id":1,"title":"落实工作任务总结工作情况"},{"id":1,"system_id":15,"title":"营造浓厚氛围夯实工作基础"},{"id":2,"system_id":15,"title":"加强理论武装突出廉政建设"},{"id":7,"system_id":15,"title":"打造精神家园培育文明新风"},{"id":8,"system_id":15,"title":"优化内部管理推进综合治理"},{"id":9,"system_id":15,"title":"美化内外环境构筑生态文明"},{"id":10,"system_id":15,"title":"落实工作任务总结工作情况"}],"tag_item":[{"id":25,"title":"党建"},{"id":1923,"title":"湖南省文明创建"},{"id":1929,"title":"线上测试"},{"id":1932,"title":"全国文明单位"}],"menu_item1":[{"id":3,"system_id":1,"title":"创建氛围"},{"id":4,"system_id":1,"title":"基础工作"},{"id":5,"system_id":1,"title":"理论武装"},{"id":6,"system_id":1,"title":"廉政建设"},{"id":11,"system_id":1,"title":"精神家园"},{"id":12,"system_id":1,"title":"文明风尚"},{"id":13,"system_id":1,"title":"综合治理"},{"id":14,"system_id":1,"title":"环境"},{"id":15,"system_id":1,"title":"落实工作任务"},{"id":16,"system_id":1,"title":"全年工作总结"},{"id":3,"system_id":15,"title":"创建氛围"},{"id":4,"system_id":15,"title":"基础工作"},{"id":5,"system_id":15,"title":"理论武装"},{"id":6,"system_id":15,"title":"廉政建设"},{"id":11,"system_id":15,"title":"精神家园"},{"id":12,"system_id":15,"title":"文明风尚"},{"id":37,"system_id":15,"title":"普法工作"},{"id":13,"system_id":15,"title":"综合治理"},{"id":38,"system_id":15,"title":"单位环境"},{"id":39,"system_id":15,"title":"落实任务"},{"id":40,"system_id":15,"title":"工作总结"}],"allsonIndustry":[{"id":1,"name":"省动物卫生监督所"},{"id":2,"name":"湖南省科学技术研究开发院"},{"id":3,"name":"湖南省青羊湖国有林场"},{"id":4,"name":"湖南省农业科学院"},{"id":6,"name":"省直机关工委"},{"id":10,"name":"湖南省畜牧水产局"},{"id":11,"name":"湖南省公安消防总队"},{"id":12,"name":"湖南省中小学教师发展中心"},{"id":13,"name":"湖南教育电视台"},{"id":16,"name":"中国电建集团中南勘测设计研究院有限公司"},{"id":17,"name":"湖南省妇女儿童发展基金会"},{"id":18,"name":"湖南省高速公路管理局"},{"id":19,"name":"省假肢矫形康复中心"},{"id":20,"name":"省卫生计生委医疗管理服务指导中心"},{"id":21,"name":"湖南省计划生育研究所"},{"id":22,"name":"省卫生计生委药具管理服务中心"},{"id":23,"name":"湖南省卫生计生综合监督局"},{"id":24,"name":"湖南省妇幼保建院"},{"id":25,"name":"省白马垅强制隔离戒毒所"},{"id":26,"name":"省戒毒管理局"},{"id":27,"name":"湖南省质监局稽查局"},{"id":28,"name":"省交通建设质量安全监督管理局"},{"id":29,"name":"省国土资源规划院"},{"id":30,"name":"湖南省建筑设计院有限公司"},{"id":31,"name":"省食品安全审评认证中心"},{"id":32,"name":"中国保险监督管理委员会湖南监管局"},{"id":33,"name":"湖南天地人律师事务所"},{"id":34,"name":"省科学技术馆"},{"id":35,"name":"省公安边防总队"},{"id":36,"name":"省军供总站"},{"id":37,"name":"湖南中移通信技术工程有限公司"},{"id":38,"name":"省体育局体育彩票管理中心"},{"id":39,"name":"省体育场"},{"id":40,"name":"省地矿医院"},{"id":41,"name":"广州铁路公安局长沙公安处"},{"id":42,"name":"中邮人寿保险股份有限公司湖南分公司"},{"id":43,"name":"湖南省不动产登记中心"},{"id":44,"name":"中国农业科学院麻类研究所"},{"id":45,"name":"湖南省建设工程质量安全监督管理总站"},{"id":46,"name":"湖南省永龙高速公路建设开发有限公司"},{"id":47,"name":"怀化铁路运输检察院"},{"id":48,"name":"省科协青少年科技中心"},{"id":49,"name":"湖南省煤炭地质勘查院"},{"id":50,"name":"第二课堂杂志社"},{"id":51,"name":"湖南中冶长天重工科技有限公司"},{"id":52,"name":"省酒埠江水电站"},{"id":53,"name":"长沙铁路运输法院"},{"id":54,"name":"省水产科学研究所"},{"id":55,"name":"衡阳铁路运输法院"},{"id":56,"name":"湖南君见律师事务所"},{"id":58,"name":"省直单位会计事务工作指导中心"},{"id":59,"name":"省农药检定所"},{"id":60,"name":"湖南省湘诚国有资产经营投资有限责任公司"},{"id":61,"name":"省畜牧兽医研究所"},{"id":62,"name":"省饲料工业办公室"},{"id":63,"name":"省农垦管理服务站"},{"id":64,"name":"省兽药饲料监察所"},{"id":65,"name":"湖南省微生物研究院"},{"id":66,"name":"省农业机械管理局"},{"id":67,"name":"省石化行业离退休人员管理服务和后勤保障中心"},{"id":68,"name":"省轻工行业离退休人员管理服务和后勤保障中心"},{"id":69,"name":"省产商品质量监督检验研究院"},{"id":70,"name":"省长康监狱"},{"id":71,"name":"省邵阳监狱"},{"id":72,"name":"省长沙监狱"},{"id":73,"name":"省娄底监狱"},{"id":74,"name":"省监狱后勤事务管理所"},{"id":75,"name":"省监狱管理局"},{"id":76,"name":"省怀化监狱"},{"id":77,"name":"省茶陵监狱"},{"id":78,"name":"省湘南监狱"},{"id":79,"name":"湖南张家界大鲵国家级自然保护区管理处"},{"id":80,"name":"中国电信湖南客户服务中心"},{"id":81,"name":"省教育生产装备处"},{"id":82,"name":"省残疾人劳动就业服务中心"},{"id":83,"name":"省残疾人福利基金会"},{"id":84,"name":"省残疾人辅助器具中心"},{"id":85,"name":"省残疾人康复研究中心"},{"id":86,"name":"湖南省食品药品监督管理局投诉举报中心"},{"id":87,"name":"湖南省药品审评认证与不良反应监测中心"},{"id":88,"name":"湖南省纤维检验局"},{"id":89,"name":"省质量技术评审中心"},{"id":90,"name":"湖南省高等学校干部培训中心"},{"id":91,"name":"省接待基地筹建处"},{"id":92,"name":"省食品药品监督管理局培训中心"},{"id":93,"name":"省墙体材料改革办公室"},{"id":94,"name":"省防汛通讯中心"},{"id":95,"name":"湖南省水府庙水电站"},{"id":96,"name":"湖南食品药品安全信息中心"},{"id":97,"name":"省无线电监测站"},{"id":98,"name":"省冶金行业离退休人员管理服务和后勤保障中心"},{"id":99,"name":"湖南枫林宾馆"},{"id":100,"name":"湖南省国土资源信息中心"},{"id":101,"name":"湖南省湘诚融资担保有限责任公司"},{"id":102,"name":"湖南省未成年犯管教所"},{"id":103,"name":"湖南省机关事业单位养老保险管理服务中心"},{"id":104,"name":"长沙出入境检验检疫局"},{"id":105,"name":"湖南广播电视台卫视频道"},{"id":106,"name":"湖南省疾病预防控制中心"},{"id":107,"name":"中国建设银行股份有限公司长沙华兴支行"},{"id":108,"name":"湖南省郴州监狱"},{"id":109,"name":"湖南省水利水电勘测设计研究总院"},{"id":110,"name":"省气象科学研究所"},{"id":111,"name":"省气象信息中心"},{"id":112,"name":"省气候中心"},{"id":114,"name":"中国人民银行长沙中心支行"},{"id":115,"name":"湖南省国家安全厅"},{"id":116,"name":"国网湖南省电力公司本部"},{"id":117,"name":"湖南省土地综合整治局"},{"id":118,"name":"湖南省学生资助管理中心"},{"id":119,"name":"快乐购物股份有限公司"},{"id":120,"name":"湖南省气象灾害防御中心（原防雷中心）"},{"id":121,"name":"湖南中医药高等专科学校"},{"id":122,"name":"湖南省职业病防治院"},{"id":123,"name":"怀化铁路运输法院"},{"id":124,"name":"湖南省社会保险管理服务局"},{"id":125,"name":"湖南省湘诚房地产开发有限公司"},{"id":126,"name":"长沙铁路运输检察院"},{"id":127,"name":"湖南省机构编制委员会办公室"},{"id":128,"name":"湖南省商业技师学院"},{"id":129,"name":"湖南省东安监狱"},{"id":130,"name":"湖南广播电视台国际频道"},{"id":131,"name":"湖南省地质博物馆"},{"id":132,"name":"湖南省气象技术装备中心"},{"id":133,"name":"湖南省水利水电科学研究院"},{"id":134,"name":"湖南省第一测绘院"},{"id":135,"name":"津市监狱"},{"id":136,"name":"湖南省军粮长沙供应站"},{"id":137,"name":"湖南省医学会"},{"id":138,"name":"湖南省人民医院"},{"id":139,"name":"中航长沙设计研究院有限公司"},{"id":140,"name":"湖南省食品和工业产品生产许可审查中心"},{"id":141,"name":"中国能源建设集团湖南省电力设计院有限公司"},{"id":142,"name":"湖南省交通运输厅交通建设造价管理站造价站"},{"id":143,"name":"湖南邵永高速公路有限公司"},{"id":144,"name":"湖南省建材行业离退休人员管理服务和后勤保障中心"},{"id":145,"name":"省卫生计生委健康教育宣传中心"},{"id":146,"name":"湖南省省直单位经济适用住房发展中心"},{"id":147,"name":"省网岭监狱"},{"id":148,"name":"湖南省森林植物园"},{"id":149,"name":"湖南省粮油产品质量监测中心"},{"id":150,"name":"潇湘晨报社"},{"id":151,"name":"中国民用航空湖南安全监督管理局"},{"id":152,"name":"湖南省测绘产品质量监督检验授权站"},{"id":153,"name":"湖南长益高速公路有限公司"},{"id":154,"name":"湖南省园艺研究所"},{"id":155,"name":"湖南省纺织行业离退休人员管理服务和后勤保障中心"},{"id":156,"name":"湖南省农业经济和农业区划研究所"},{"id":157,"name":"湖南省公路管理局"},{"id":158,"name":"湖南省福利彩票发行中心"},{"id":159,"name":"湖南省农业信息与工程研究所"},{"id":160,"name":"湖南师大附中"},{"id":161,"name":"湖南省特教中等专业学校"},{"id":162,"name":"湖南省交通运输厅科技信息中心"},{"id":163,"name":"湖南省食品质量监督检验研究院"},{"id":164,"name":"湖南省安全技术中心"},{"id":165,"name":"湖南省体育局装备服务中心"},{"id":166,"name":"湖南省老干部休养所"},{"id":167,"name":"湖南省文物考古研究所"},{"id":168,"name":"湖南省高速公路管理局郴州管理处"},{"id":169,"name":"湖南省地质中学"},{"id":170,"name":"湖南省高速公路管理局岳阳管理处"},{"id":171,"name":"湖南省农业科学院后勤服务中心"},{"id":172,"name":"湖南省高速公路管理局娄底管理处"},{"id":173,"name":"湖南省道路运输管理局"},{"id":174,"name":"湖南省电化教育馆"},{"id":175,"name":"湖南省高速公路管理局邵阳管理处"},{"id":176,"name":"中共湖南省委台湾工作办公室"},{"id":177,"name":"湖南省特种设备检验检测研究院"},{"id":178,"name":"湖南省水库移民开发管理局"},{"id":179,"name":"湖南省高速公路管理局衡阳管理处"},{"id":180,"name":"湖南省卫生计生委"},{"id":181,"name":"湖南省高速公路管理局长沙管理处"},{"id":182,"name":"湖南司法警官职业学院"},{"id":183,"name":"湖南省动物疫病预防控制中心"},{"id":184,"name":"国网湖南后勤中心"},{"id":185,"name":"国网湖南管培中心"},{"id":187,"name":"国网湖南防灾减灾中心"},{"id":188,"name":"国网湖南供电服务中心（计量中心）"},{"id":189,"name":"国网湖南物资公司"},{"id":190,"name":"国网湖南检修公司"},{"id":191,"name":"国网湖南经研院"},{"id":192,"name":"国网湖南电科院"},{"id":193,"name":"湖南省送变电工程有限公司"},{"id":194,"name":"湖南省建设干部学校"},{"id":195,"name":"湖南省建设工程造价管理总站"},{"id":196,"name":"湖南省农产品加工研究所"},{"id":197,"name":"益娄公司"},{"id":198,"name":"湖南出入境检验检疫局醴陵办事处"},{"id":199,"name":"省高速公路管理局湘西管理处"},{"id":200,"name":"湖南出入境检验检疫局浏阳办事处"},{"id":201,"name":"湖南科技报社"},{"id":202,"name":"湖南省公安厅交通管理局"},{"id":203,"name":"长沙建筑工程学校"},{"id":204,"name":"中建五局投资管理公司"},{"id":205,"name":"中建信和地产公司"},{"id":206,"name":"中建五局安装公司"},{"id":207,"name":"中建五局土木公司"},{"id":208,"name":"湖南省林业调查规划设计院"},{"id":209,"name":"湖南省机械行业离退休人员管理服务和后勤保障中心"},{"id":210,"name":"湖南省老干部活动中心"},{"id":211,"name":"湖南机电职业技术学院"},{"id":212,"name":"湖南省文化馆"},{"id":213,"name":"湖南省地质测试研究院"},{"id":214,"name":"湖南省白泥湖戒毒康复所"},{"id":215,"name":"湖南省质量和标准化研究院"},{"id":216,"name":"湖南省博物馆"},{"id":217,"name":"湖南省德山监狱"},{"id":218,"name":"湖南省少年儿童图书馆"},{"id":219,"name":"湖南省土壤肥料研究所"},{"id":220,"name":"湖南省水运管理局"},{"id":221,"name":"湖南省林业科学院"},{"id":222,"name":"省辐射环境监督站"},{"id":223,"name":"省环境应急与事故调查中心"},{"id":224,"name":"省环境监察局"},{"id":225,"name":"省环境保护宣传教育中心"},{"id":226,"name":"省委办公厅"},{"id":227,"name":"省委组织部"},{"id":228,"name":"湖南省人大常委会机关"},{"id":229,"name":"省长株潭两型试验区工委、管委会"},{"id":231,"name":"省环境保护科学研究院"},{"id":232,"name":"省公共资源交易中心"},{"id":233,"name":"省环境监测中心"},{"id":234,"name":"省总工会"},{"id":235,"name":"湖南省教育厅信息中心"},{"id":236,"name":"省机场管理有限公司"},{"id":237,"name":"湖南省教育考试院"},{"id":238,"name":"省纪委省监委"},{"id":239,"name":"湖南省益马高速公路建设开发有限公司"},{"id":240,"name":"省农业委员会"},{"id":241,"name":"湖南省气象服务中心"},{"id":242,"name":"省政协"},{"id":243,"name":"湖南省第三测绘院"},{"id":244,"name":"湖南省计量检测研究院"},{"id":245,"name":"湖南省水利厅"},{"id":246,"name":"湖南图书馆"},{"id":247,"name":"湖南省水库移民经济服务中心"},{"id":248,"name":"湖南省林业厅"},{"id":249,"name":"省教科院"},{"id":250,"name":"湖南省药品检验研究院"},{"id":251,"name":"省委政研室（改革办）"},{"id":252,"name":"湖南省科学技术厅"},{"id":253,"name":"湖南省直单位职工集中住宅区"},{"id":255,"name":"湖南省广播电视微波总站"},{"id":256,"name":"湖南省知识产权局"},{"id":257,"name":"省委党校湖南行政学院"},{"id":258,"name":"湖南省永州监狱"},{"id":259,"name":"湖南省散装水泥办公室"},{"id":260,"name":"省委老干部局"},{"id":261,"name":"湖南省扶贫开发办公室"},{"id":262,"name":"湖南省结核病防治所"},{"id":263,"name":"湖南省水库移民开发管理局培训中心"},{"id":264,"name":"长沙丰升置业有限责任公司"},{"id":265,"name":"省委直属机关党校"},{"id":266,"name":"省体育局"},{"id":267,"name":"省委党史研究室"},{"id":268,"name":"湖南省农业机械鉴定站"},{"id":269,"name":"省粮食局"},{"id":270,"name":"省有色地质勘查局二四七队"},{"id":271,"name":"湖南省韶山管理局"},{"id":272,"name":"省食品药品监督管理局"},{"id":273,"name":"湖南广播电视台后勤保障中心"},{"id":274,"name":"湖南省档案局（馆）"},{"id":275,"name":"湖南省供销合作总社"},{"id":276,"name":"湖南警察学院"},{"id":277,"name":"共青团湖南省委"},{"id":278,"name":"湖南教育出版社"},{"id":279,"name":"湖南省农村信用社联合社"},{"id":280,"name":"省妇联"},{"id":281,"name":"英大泰和财产保险股份有限公司湖南分公司"},{"id":282,"name":"省人民政府参事室"},{"id":283,"name":"省科协"},{"id":284,"name":"湖南省就业服务局"},{"id":285,"name":"衡阳铁路运输检察院"},{"id":286,"name":"省归国华侨联合会"},{"id":288,"name":"湖南和天工程项目管理有限公司"},{"id":289,"name":"湖南省残疾人联合会"},{"id":290,"name":"湖南省高速公路管理局永州管理处"},{"id":291,"name":"省委宣传部"},{"id":292,"name":"省环境保护厅"},{"id":293,"name":"省文化厅"},{"id":294,"name":"湖南省水利水电施工管理局"},{"id":295,"name":"湖南广播电视台"},{"id":296,"name":"省新闻出版广电局"},{"id":297,"name":"湖南省工商行政管理局"},{"id":298,"name":"湖南省地质环境监测总站（中心）"},{"id":299,"name":"湖南省蚕桑科学研究所"},{"id":300,"name":"省质量技术监督局"},{"id":301,"name":"湖南省女子监狱"},{"id":302,"name":"中共湖南省委讲师团"},{"id":303,"name":"省商务厅"},{"id":306,"name":"省政府金融办"},{"id":307,"name":"国网湖南信通公司"},{"id":308,"name":"湖南省有色地质勘查局"},{"id":309,"name":"湖南省煤田地质局物探测量队"},{"id":310,"name":"国家法官学院湖南分院"},{"id":311,"name":"湖南省地质矿产勘查开发局"},{"id":312,"name":"湖南省蔬菜研究所"},{"id":313,"name":"湖南省核工业地质局"},{"id":314,"name":"湖南省高速公路管理局湘潭管理处"},{"id":315,"name":"常德出入境检验检疫局"},{"id":316,"name":"湖南省有色金属管理局"},{"id":318,"name":"省二○二工程管理处"},{"id":319,"name":"湖南省煤炭管理局"},{"id":320,"name":"中国建设银行湖南省分行"},{"id":321,"name":"省地方志编纂委员会"},{"id":322,"name":"湖南广播电视网络传输中心"},{"id":323,"name":"湖南省煤田地质局"},{"id":324,"name":"湖南安全技术职业学院"},{"id":325,"name":"湖南省文学艺术界联合会"},{"id":326,"name":"湖南省黄金管理局"},{"id":327,"name":"湖南省贸促会"},{"id":328,"name":"湖南省社会科学院"},{"id":329,"name":"省红十字会"},{"id":330,"name":"省作家协会"},{"id":331,"name":"省国资委"},{"id":334,"name":"湖南省黎托强制隔离戒毒所"},{"id":335,"name":"中医药研究院"},{"id":336,"name":"国家新闻出版广电总局282台"},{"id":337,"name":"财富证券有限责任公司"},{"id":340,"name":"湖南省欧阳海灌区管理局"},{"id":342,"name":"湖南省气象局后勤服务中心"},{"id":343,"name":"湖南出入境检验检疫局"},{"id":344,"name":"湖南省水文水资源勘测局"},{"id":346,"name":"长沙海关"},{"id":347,"name":"湖南省直单位住房公积金管理中心"},{"id":348,"name":"省国税局"},{"id":350,"name":"中共湖南省委统战部"},{"id":351,"name":"省气象局"},{"id":352,"name":"湖南省医疗工伤生育保险管理服务局"},{"id":353,"name":"中共湖南省委政法委员"},{"id":354,"name":"湖南省地震局"},{"id":355,"name":"湖南省人民政府发展研究中心"},{"id":356,"name":"湖南省社会主义学院"},{"id":357,"name":"湖南省妇女儿童活动中心"},{"id":358,"name":"湖南省工商业联合会"},{"id":359,"name":"国家统计局湖南调查总队"},{"id":360,"name":"湖南教育报刊集团有限公司"},{"id":361,"name":"省民族宗教事务委员会"},{"id":362,"name":"湖南煤矿安全监察局"},{"id":363,"name":"湖南省儿童医院"},{"id":364,"name":"省法院"},{"id":365,"name":"湖南省社会科学界联合会"},{"id":366,"name":"湖南省人民检察院"},{"id":368,"name":"省司法厅"},{"id":369,"name":"中国气象局气象干部培训学院湖南分院"},{"id":371,"name":"湖南省民政厅"},{"id":372,"name":"湖南省信访局"},{"id":374,"name":"省外事侨务办"},{"id":375,"name":"湖南能源监管办"},{"id":376,"name":"省气象台"},{"id":377,"name":"长沙环境保护职业技术学院"},{"id":378,"name":"湖南储备物资管理局"},{"id":379,"name":"湖南省植物保护研究所"},{"id":381,"name":"审计署驻长沙特派员办事处"},{"id":382,"name":"湖南银监局"},{"id":384,"name":"湖南省通信管理局"},{"id":385,"name":"财政部驻湖南专员办"},{"id":388,"name":"省政府法制办"},{"id":389,"name":"民主党派"},{"id":390,"name":"省公安厅"},{"id":394,"name":"省安全厅"},{"id":396,"name":"中共湖南省委防范和处理邪教问题领导小组办公室"},{"id":397,"name":"湖南省机关事务管理局"},{"id":399,"name":"省政府办公厅"},{"id":402,"name":"核工业二三O研究所"},{"id":404,"name":"湖南省交通运输厅"},{"id":408,"name":"省发展和改革委员会"},{"id":412,"name":"省国土资源厅"},{"id":414,"name":"湖南省经济和信息化委员会"},{"id":417,"name":"湖南省财政厅"},{"id":419,"name":"湖南省人力资源和社会保障厅"},{"id":421,"name":"湖南省审计厅"},{"id":423,"name":"湖南省教育厅"},{"id":425,"name":"湖南省住房和城乡建设厅"},{"id":427,"name":"中国科学院亚热带农业生态研究所"},{"id":428,"name":"省地税局"},{"id":431,"name":"湖南省安全生产监督管理局"},{"id":432,"name":"国家林业局中南林业调查规划设计院"},{"id":433,"name":"省人防办"},{"id":434,"name":"中铁城建集团有限公司"},{"id":435,"name":"长沙矿冶研究院有限责任公司"},{"id":438,"name":"中建五局"},{"id":444,"name":"湖南黑麋峰抽水蓄能有限公司"},{"id":445,"name":"湖南省烟草专卖局"},{"id":447,"name":"中冶长天国际工程有限责任公司"},{"id":451,"name":"中核集团湖南桃花江核电有限公司"},{"id":453,"name":"湖南省电力线路器材有限公司"},{"id":454,"name":"澧水公司"},{"id":455,"name":"大唐集团湖南分公司"},{"id":462,"name":"湖南省气象局运营中心"},{"id":465,"name":"省卫生计生委培训中心"},{"id":467,"name":"湖南公共频道"},{"id":468,"name":"湖南劳动人事职业学院"},{"id":470,"name":"省专用通信局"},{"id":471,"name":"湖南第一师范学院第二附属小学"},{"id":472,"name":"湖南经视台"},{"id":473,"name":"湖南国际会展中心"},{"id":474,"name":"国土厅征用地事务中心"},{"id":475,"name":"湖南省第二测绘院"},{"id":476,"name":"湖南地图出版社有限责任公司"},{"id":478,"name":"湖南省星城监狱"},{"id":479,"name":"湖南秦希燕联合律师事务所"},{"id":480,"name":"湖南省广播电视监测与安全播出调度中心"},{"id":481,"name":"湖南省水利水电医院"},{"id":482,"name":"湖南省原种猪场"},{"id":483,"name":"省直机关工委"},{"id":484,"name":"省有色地质勘查局工程地质总队"},{"id":485,"name":"湖南省商业食品行业离退休人员管理服务和后勤保障中心"},{"id":486,"name":"湖南省长沙市第一中学"},{"id":487,"name":"湖南工业贸易学校"},{"id":488,"name":"湖南杂交水稻研究中心"},{"id":489,"name":"湖南省雁北监狱"},{"id":491,"name":"湖南省大中专学校学生信息咨询与就业指导中心"},{"id":493,"name":"中建不二幕墙公司"},{"id":494,"name":"中建装饰公司"},{"id":495,"name":"省质量技术监督局信息中心"},{"id":496,"name":"湖南省洞庭湖生态环境监测中心"},{"id":497,"name":"湖南储备物资管理局国储物流公司"},{"id":498,"name":"湖南储备物资管理局772处"},{"id":499,"name":"湖南储备物资管理局336处"},{"id":500,"name":"湖南储备物资管理局579处"},{"id":501,"name":"湖南储备物资管理局155处"},{"id":502,"name":"湖南储备物资管理局374处"},{"id":503,"name":"湖南储备物资管理局375处"},{"id":504,"name":"湖南储备物资管理局633处"},{"id":505,"name":"湖南储备物资管理局154处"},{"id":513,"name":"湖南省卫生计生委人才交流服务中心"},{"id":514,"name":"湖南省科学技术信息研究所"},{"id":515,"name":"湖南省教育基金会秘书处"},{"id":516,"name":"省新闻出版广电局监听监看中心"},{"id":517,"name":"湖南省科学技术咨询中心"},{"id":518,"name":"省公安厅警卫局"},{"id":519,"name":"省中医药学会"},{"id":520,"name":"省卫生计生委医学考试中心"},{"id":521,"name":"湖南省脑科医院"},{"id":522,"name":"省核农学与航天育种研究所"},{"id":523,"name":"省水稻研究所"},{"id":524,"name":"省作物研究所"},{"id":525,"name":"省经济贸易高级技工学校"},{"id":526,"name":"湖南中华职业教育社"},{"id":527,"name":"省岳阳监狱"},{"id":528,"name":"省新闻出版广电局邵阳中波转播台"},{"id":529,"name":"省商务厅培训中心"},{"id":530,"name":"省新闻出版广电局湘潭实验台"},{"id":531,"name":"省新闻出版广电局张家界实验台"},{"id":532,"name":"省政府直属机关第二幼儿园"},{"id":533,"name":"长沙航道管理局"},{"id":534,"name":"省体育模型和摩托艇运动管理中心"},{"id":535,"name":"省田径运动管理中心"},{"id":536,"name":"湖南贺龙体育馆"},{"id":537,"name":"省测绘局大院管理所"},{"id":538,"name":"湖南省德安高速公路有限责任公司"},{"id":539,"name":"省农业环境生态研究所"},{"id":540,"name":"省农业生物技术研究所"},{"id":541,"name":"省新闻出版广电局湘西中波转播台"},{"id":542,"name":"省新闻出版广电局怀化中波转播台"},{"id":543,"name":"省新闻出版广电局常德中波转播台"},{"id":544,"name":"省新闻出版广电局永州中波转播台"},{"id":545,"name":"省新闻出版广电局衡阳中波转播台"},{"id":546,"name":"省新闻出版广电局益阳实验台"},{"id":547,"name":"省新闻出版广电局郴州中波转播台"},{"id":548,"name":"省新闻出版广电局株洲实验台"},{"id":549,"name":"省测绘科技研究所"},{"id":550,"name":"省赤山监狱"},{"id":551,"name":"省女子强制隔离戒毒所"},{"id":552,"name":"省坪塘强制隔离戒毒所"},{"id":553,"name":"省茶叶研究所"},{"id":555,"name":"省麓山强制隔离戒毒所"},{"id":556,"name":"省新开铺强制隔离戒毒所"},{"id":557,"name":"湖南金鹰之声传媒有限责任公司"},{"id":558,"name":"湖南广播电视台娱乐频道"},{"id":559,"name":"湖南快乐先锋传媒有限公司"},{"id":560,"name":"湖南乐田电影媒体有限公司"},{"id":561,"name":"湖南省新闻出版广电局检测中心"},{"id":562,"name":"湖南省新闻出版广电局岳阳中波转播台"},{"id":563,"name":"湖南省新闻出版广电局中波台管理中心"},{"id":564,"name":"湖南省国土资源厅干部教育培训中心"},{"id":565,"name":"省国土资源厅宣传中心"},{"id":566,"name":"省白泥湖强制隔离戒毒所"},{"id":567,"name":"省交通运输厅规划与项目办公室"},{"id":568,"name":"系统报道"},{"id":569,"name":"湖南省地质调查院"},{"id":570,"name":"省环境保护厅环境工程评估中心"},{"id":571,"name":"省固体废物管理站"},{"id":572,"name":"韶山毛泽东同志纪念馆"},{"id":573,"name":"湖南省韶山管理局韶山宾馆"},{"id":574,"name":"韶山毛泽东图书馆"},{"id":575,"name":"韶山毛泽东广场管理处"},{"id":576,"name":"湖南省韶山管理局园林环卫管理处"},{"id":577,"name":"湖南省韶山管理局供水公司"},{"id":578,"name":"省主要污染物排污权储备交易中心"},{"id":579,"name":"湖南广播电视台电视剧频道"},{"id":580,"name":"湖南长天自控工程有限公司"},{"id":581,"name":"中冶长天置业有限公司"},{"id":582,"name":"湖南省煤田地质局油气资源勘探队"},{"id":583,"name":"湖南省湘诚信息科技有限公司"},{"id":584,"name":"湖南省医疗器械检验检测所"}]}
     */

    private String error_msg;
    private int error_code;
    private DataBean data;

    public String getError_msg() {
        return error_msg;
    }

    public void setError_msg(String error_msg) {
        this.error_msg = error_msg;
    }

    public int getError_code() {
        return error_code;
    }

    public void setError_code(int error_code) {
        this.error_code = error_code;
    }

    public DataBean getData() {
        return data;
    }

    public void setData(DataBean data) {
        this.data = data;
    }

    public static class DataBean {
        private List<MenuItemBean> menu_item;
        private List<TagItemBean> tag_item;
        private List<MenuItem1Bean> menu_item1;
        private List<AllsonIndustryBean> allsonIndustry;

        public List<MenuItemBean> getMenu_item() {
            return menu_item;
        }

        public void setMenu_item(List<MenuItemBean> menu_item) {
            this.menu_item = menu_item;
        }

        public List<TagItemBean> getTag_item() {
            return tag_item;
        }

        public void setTag_item(List<TagItemBean> tag_item) {
            this.tag_item = tag_item;
        }

        public List<MenuItem1Bean> getMenu_item1() {
            return menu_item1;
        }

        public void setMenu_item1(List<MenuItem1Bean> menu_item1) {
            this.menu_item1 = menu_item1;
        }

        public List<AllsonIndustryBean> getAllsonIndustry() {
            return allsonIndustry;
        }

        public void setAllsonIndustry(List<AllsonIndustryBean> allsonIndustry) {
            this.allsonIndustry = allsonIndustry;
        }

        public static class MenuItemBean {
            /**
             * id : 0
             * system_id : 0
             * title : 最新动态
             */

            private int id;
            private int system_id;
            private String title;
            private boolean ischeck=false;

            public boolean isIscheck() {
                return ischeck;
            }

            public void setIscheck(boolean ischeck) {
                this.ischeck = ischeck;
            }

            public int getId() {
                return id;
            }

            public void setId(int id) {
                this.id = id;
            }

            public int getSystem_id() {
                return system_id;
            }

            public void setSystem_id(int system_id) {
                this.system_id = system_id;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }
        }

        public static class TagItemBean {
            /**
             * id : 25
             * title : 党建
             */

            private int id;
            private String title;
            private boolean ischeck=false;

            public boolean isIscheck() {
                return ischeck;
            }

            public void setIscheck(boolean ischeck) {
                this.ischeck = ischeck;
            }

            public int getId() {
                return id;
            }

            public void setId(int id) {
                this.id = id;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }
        }

        public static class MenuItem1Bean {
            /**
             * id : 3
             * system_id : 1
             * title : 创建氛围
             */

            private int id;
            private int system_id;
            private String title;

            public int getId() {
                return id;
            }

            public void setId(int id) {
                this.id = id;
            }

            public int getSystem_id() {
                return system_id;
            }

            public void setSystem_id(int system_id) {
                this.system_id = system_id;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }
        }

        public static class AllsonIndustryBean {
            /**
             * id : 1
             * name : 省动物卫生监督所
             */

            private int id;
            private String title;

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }

            public int getId() {
                return id;
            }

            public void setId(int id) {
                this.id = id;
            }

        }
    }
}
